[{"quote":"To go fast, go alone. To go far, go together","author":"African Proverb"},{"quote":"In fact, the only way to manage stress is to build up your resilience and strength.","author":"anomymous"},{"quote":"Predispose yourself to practice","author":"anonymous"},{"quote":"Respect the specs","author":"Dr. Linda F. Wilson"},{"author":"Zach Gulde"},{"quote":"You can either honor your mood or your commitment. You'll always feel like NOT doing something.","author":"anonymous"},{"quote":"The secret to building great products is not creating awesome features, it's to make your users awesome","author":"Kathy Sierra"},{"quote":"Writing is Nature's way of exposing how sloppy your thinking is.","author":"Guindon"},{"quote":"The biggest issue on software teams is making sure everyone understands what everyone else is doing.","author":"Martin Fowler"},{"quote":"Just keep pushing... even with life-mud in your eyes, and a major lack of understanding when it comes to the effect your efforts even have... it may pay off in ways you didn’t see coming (cause I mean, no one can really see that well through life-mud). If you just keep moving, the void has a much harder time swallowing you whole. You have the higher ground...","author":"Halie Koehler"},{"quote":"All social movements are dismissed at some point as complaining. Over time, they are recognized as speaking truth to power.","author":"Sarah Kendzior"},{"quote":"Whether if you think you can... or if you think you can.. you're right!","author":"Henry Ford"},{"quote":"A program is a building of thought.","author":"Marijn Haverbeke"},{"quote":"Never let formal education get in the way of your learning","author":"Mark Twain"},{"quote":"Promise me you'll always remember: you're braver than you believe, and stronger than you seem, and smarter than you think","author":"Winnie the Pooh"},{"quote":"The first rule of style is to have something to say. The second rule of style is to control yourself when, by chance, you have two things to say; say first one, then the other, not both at the same time.","author":"George Pólya"},{"quote":"Let's refine the problem statement","author":"Zach Gulde"},{"quote":"UPDATE is a code smell","author":"Zach Gulde"},{"quote":"It's more fun to talk with someone who doesn't use long, difficult words but rather short, easy words like 'What about lunch?'","author":"Winnie the Pooh"},{"quote":"Mathematics is not a spectator sport","author":"Polya"},{"quote":"The process of doing a second draft is the process of making it look like you knew what you were doing all along","author":"Neil Gaiman"},{"quote":"Travel is fatal to prejudice, bigotry, and narrow-mindedness, and many of our people need it sorely on these accounts. Broad, wholesome, charitable views of men and things cannot be acquired by vegetating in one little corner of the earth all one's lifetime.","author":"Mark Twain"},{"quote":"Seek mentors, mentorship, and be a mentor. Coffee has a huge ROI","author":"Jason Straughan"},{"quote":"You were designed for accomplishment, engineered for success, and endowed with the seeds of greatness.","author":"Zig Ziglar"},{"quote":"Whatever you are, be a good one.","name":"Abraham Lincoln"},{"quote":"Mathematics, you see, is not a spectator sport. To understand mathematics means to be able to do mathematics. And what does it mean [to be] doing mathematics? In the first place, it means to be able to solve mathematical problems","author":"Polya"},{"quote":"Programming languages allow us to formalize instructions and express logic, business rules, mathematics, processes, and automation instructions in one single language in a way where computers follows those instructions to produce utility for people.","author":"Ryan Orsinger"},{"quote":"Always remember, your focus determines your reality","author":"George Lucas"},{"quote":"You don't start out writing good stuff. You start out writing crap and thinking it's good stuff, and then gradually you get better at it. That's why I say one of the most valuable traits is persistence.","author":"Octavia Butler"},{"quote":"In many cases, the more you try to compete, the less competitive you actually are.","author":"Kathy Sierra"},{"quote":"If you can't solve a problem, then there is an easier problem you can solve: find it.","author":"Polya"},{"quote":"Discipline is choosing between what you want now and what you want most.","author":"unknown"},{"quote":"Learning a skill requires practicing that skill","author":"Luis Montealegre"},{"quote":"Programming is more about practicing than studying: a little bit of study but a lot of practice","author":"Luis Montealegre"},{"quote":"There are only two ways to live your life. One is as though nothing is a miracle. The other is as though everything is a miracle.","author":"Albert Einstein"},{"quote":"It's not what you know, it's when you know it.","author":"Kathy Sierra"},{"quote":"A dream written down with a date becomes a goal. A goal broken down into steps becomes a plan. A plan backed by action becomes reality.","author":"Greg Reid"},{"quote":"Test Driven Development is to software engineering what double-entry bookkeeping is to Accounting","author":"Ryan Orsinger"},{"quote":"Median is safe when you could use mean. Median is also safe when you shouldn't use mean. Median is useful when the distribution is normal and also useful when the data is not normally distributed.","author":"Maggie Giust"},{"quote":"It's so much easier to be negative and cynical and predict doom for the world than it is to try and figure out how to make things better. We have an obligation to do the latter.","author":"Jim Henson"},{"quote":"If you get, give. If you learn, teach","author":"Maya Angelou"},{"quote":"I can think. I can wait. I can fast.","author":"Siddhartha in Siddhartha by Herman Hesse"},{"quote":"There is no such thing as a failed experiment, only experiments with unexpected outcomes","author":"Buckminster Fuller"},{"quote":"Momentum begets momentum","author":"Gil Penchina"},{"quote":"We become what we practice.","author":"anomymous"},{"quote":"It takes years to get years of experience","author":"anonymous"},{"quote":"Enlightenment means to lighten your load, to lighten up!","author":"anonymous"},{"quote":"We don't make mistakes, just happy little accidents.","author":"Bob Ross"},{"quote":"We won’t be distracted by comparison if we are captivated with purpose","author":"unknown"},{"quote":"Let your focus be your hocus pocus!","author":"Ryan Orsinger"},{"quote":"The first rule of magic: Get off your ass!","author":"Ryan Orsinger"},{"quote":"Make your customers more awesome! Upgrade your user, not your product... make people better at something they want to get better at","author":"Kathy Sierra"},{"quote":"The only way to deep happiness is to do something you love to the best of your ability","author":"Richard Feynman"},{"quote":"Fall down seven times, get up eight.","author":"Japanese Proverb"},{"quote":"build something 100 people love, not something 1 million people kind of like","author":"Brian Chesky"},{"quote":"Abiding avoidant behavior in yourself is a road paved to only one thing: getting better at avoidant behavior.","author":"Ryan Orsinger"},{"quote":"The code never lies. Even when the code is lying, the code never lies.","author":"Ryan Orsinger"},{"quote":"Code does what it is told to do, not what you mean it to do.","author":"Ryan Orsinger"},{"quote":"Practicing sewing/designing clothes? If all you have is expensive cloth, you'll never want to cut and learn to sew. No one learns to drive in a Ferrari on a mountain road.","author":"Kathleen Dollard"},{"quote":"Computer science is about computers in the same way that astronomy is about telescopes. Rather than being about our tools, we're formalizing ways for discussing and designing processes.","author":"Professor Gerald Jay Sussman"},{"quote":"If you have the words, you can more easily speak the language","author":"Zora"},{"quote":"I try to look at everything like I look at doors. Which side is the hinge on? Which direction the door opens, the path the user takes to proceed through, and whether or not it has a flat panel to push. Is there a pull bar to pull open? That's how I approach User Interface design. I want it to be the door that I don't think about.","author":"Risa"},{"quote":"If it aint in source control then it doesn't exist.","author":"Jason Straughan"},{"quote":"Success is the progressive realization of a worthy goal","author":"Earl Nightingale"},{"quote":"The strangest secret of success: We become what we think about","author":"Earl Nightingale"},{"quote":"Learning a skill requires practicing that skill","author":"Luis Montealegre"},{"quote":"You can't teach a kid to ride a bike at a seminar","author":"David Sandler"},{"quote":"Talent is a pursued interest. In other words, anything you are willing to practice, you can do.","author":"Bob Ross"},{"quote":"Know the brain you have to get the brain you want","author":"Julia Galef"},{"quote":"Take baby steps, just dont stop.","author":"Luis Montealegre"},{"quote":"If at first you don't succeed, slow down and try a smaller task.","author":"Ryan Orsinger"},{"quote":"What’s the one thing you can do, such that by doing it, everything else will be easier or unnecessary?","author":"Gary Keller"},{"quote":"You can't buy focus. But you can rent it by paying attention to what you're doing.","author":"Ryan Orsinger"},{"quote":"If you want to achieve greatness, stop asking for permission!","author":"anonymous"},{"quote":"Sometimes, the best debugger is a good night's rest. Or a walk.","author":"Ryan Orsinger"},{"quote":"When encounering a bug or something unexpected, do you find your first emotional reaction to be delight, curiosity, confusion, or irritation? Which one of those is most sustainable?","author":"Ryan Orsinger"},{"quote":"What if the Hokey Pokey really IS what it's all about?","author":"anonymous"},{"quote":"Never say, 'oops'. Always say, 'Ah, interesting'.","author":"anonymous"},{"quote":"You're going to make mistakes. The real mistake is not learning from them","author":"anonymous"},{"quote":"A ship in port is safe, but that's not what ships are built for.","author":"Admiral Grace Hopper"},{"quote":"It is often easier to ask for forgiveness than to ask for permission.","author":"Admiral Grace Hopper"},{"quote":" A human must turn information into intelligence or knowledge. We've tended to forget that no computer will ever ask a new question.","author":"Admiral Grace Hopper"},{"quote":"You don't manage people; you manage things. You lead people.","author":"Admiral Grace Hopper"},{"quote":"If it's a good idea, go ahead and do it. It's much easier to apologize than it is to get permission.","author":"Admiral Grace Hopper"},{"quote":"I think the most powerful collection of knowledge that somebody can have is a mailing list of the people that can possibly help them.","author":"Jenn Schiffer"},{"quote":"If we keep doing what we're doing, we're going to keep getting what we're getting.","author":"Stephen Covey"},{"quote":"To go fast, you must first go slow.","author":"anonymous"},{"quote":"When you come to a fork in the road, take it!","author":"Yogi Berra"},{"quote":"A coach is someone who tells you what you don't want to hear, who has you see what you don't want to see, so you can be who you have always known you could be.","author":"Tom Landry"},{"quote":"The number one learning objective is 'Working with others effectively to find and solve problems in the face of uncertainty'","author":"Justin Reich"},{"quote":"Failure is the opportunity to begin again more intelligently.","author":"Henry Ford"},{"quote":"They say that 'The code doesn't lie'. And I've noticed that even when it's lying, the code doesn't lie.","author":"Ryan Orsinger"},{"quote":"Master your instrument, master the music, and then  forget all that bullshit and just play","author":"Charlie Parker"},{"quote":"You can be happy or you can be unhappy. It's just according to the way you look at things","author":"Walt Disney"},{"quote":"Feigned indifference doesn't get you what you want. Try being earnest!","author":"Ryan Orsinger"},{"quote":"We cannot direct the wind, but we can adjust the sails.","author":"Dolly Parton"},{"quote":"If you don't sacrifice for what you want, what you want becomes the sacrifice","author":"anonymous"},{"quote":"I think that making things easy is sort-of like a way to \"invent\" a new feature for people!","author":"Julia Evans"},{"quote":"Technical issues can be a huge pain point","author":"Elle Vargas"},{"quote":"Programming is a way of thinking","author":"anonymous"},{"quote":"Test your ideas, follow the evidence, and always remember that you could be wrong.","author":"Pascall Allen"},{"quote":"Master your instrument, master the music, then forget all that bullshit and just play.","author":"Charlie Parker"},{"quote":"Comparing to another activity is useful if it helps you formulate questions, it's dangerous when you use it to justify answers.","author":"Martin Fowler"},{"quote":"It is possible to commit no mistakes and still lose. That is not a weakness. That is life.","author":"Jean-Luc Picard"},{"quote":"Making an evidence presentation is a moral act as well as an intellectual activity. To maintain standards of quality, relevance, and integrity for evidence, consumers of presentations should insist that presenters be held intellectually and ethically responsible for what they show and tell. Thus consuming a presentation is also an intellectual and a moral activity.","author":"Edward Tufte"},{"quote":"Medical statistics will be our standard of measurement: we will weight life for life and see where the dead lie thicker, among the workers or among the privileged.","author":"Rudolf Virchow"},{"quote":"What was observed by us is the nature or matter of the Milky Way itself, which, with the aid of the spyglass, may be observed so well that all the disputes that for so many generations have vexed philosophiers are destroyed by visible certainty, and we are liberated from wordy arguments.","author":"Galileo Galilei"},{"quote":"Let's answer questions experimentally rather than theoretically","author":"Zach Gulde"},{"quote":"Nothing in life is to be feared, it is only to be understood. Now is the time to understand more, so that we may fear less.","author":"Marie Curie"}]